{"mode":"normal","description":"<p>These cards are designed to help you learn and memorize the key concepts. Try to answer from memory before flipping the cards.<\/p>","dialogs":[{"tips":[],"text":"<p style=\"text-align: center;\">Project Communication<\/p>","answer":"<p style=\"text-align: center;\">Project communication involves maintaining relevant and up-to-date information, informing stakeholders, and involving them in decision-making. Communication should be organized, conducted professionally, and all discussed information needs to be recorded.<\/p>"},{"tips":[],"text":"<p style=\"text-align: center;\">Meetings in Project Management<\/p>","answer":"<p style=\"text-align: center;\">Meetings are essential in project management to keep stakeholders informed about project progress, make decisions, and follow up on actions. They are organized to discuss important decisions, key issues, and actions that need to be taken.<\/p>"},{"tips":[],"text":"<p style=\"text-align: center;\">Virtual Meetings<\/p>","answer":"<p style=\"text-align: center;\">Virtual meetings offer advantages such as reduced travel expenses and increased accessibility but come with disadvantages like less face-to-face contact and technical difficulties. They provide a more inclusive workplace for employees who cannot travel.<\/p>"},{"tips":[],"text":"<p style=\"text-align: center;\">Preparing for Meetings<\/p>","answer":"<p style=\"text-align: center;\">Preparing for meetings involves developing an agenda aligned with the meeting's purpose and understanding the different levels of the meeting. It is essential to control the meeting, establish the necessary attendees, and consider group dynamics.<\/p>"},{"tips":[],"text":"<p style=\"text-align: center;\">Developing an Effective Meeting Agenda<\/p>","answer":"<p style=\"text-align: center;\">Developing an effective meeting agenda involves engaging participants through icebreakers, exploring the importance of a well-structured agenda, and explaining the step-by-step process for creating one. It also includes evaluating participants' understanding and collecting feedback for improvement.<\/p>"},{"tips":[],"text":"<p style=\"text-align: center;\">Group Dynamics in Meetings<\/p>","answer":"<p style=\"text-align: center;\">Understanding group behavior in meetings helps in managing group interactions, improving meeting results, resolving conflicts, and identifying potential areas of conflict. It allows for better management of group dynamics and enhances meeting outcomes.<\/p>"},{"tips":[],"text":"<p style=\"text-align: center;\">Formal vs. Informal Groups<\/p>","answer":"<p style=\"text-align: center;\">Formal groups are consciously created by organizations to fulfill specific tasks, while informal groups are formed by members for various purposes. Formal groups focus on specific objectives, whereas informal groups may or may not align with organizational goals.<\/p>"},{"tips":[],"text":"<p style=\"text-align: center;\">Roles Played in Meetings<\/p>","answer":"<p style=\"text-align: center;\">Participants in meetings take on different roles, including maintenance roles that provide support and task roles that assist in progressing the meeting. Understanding these roles helps in managing group dynamics and ensuring effective communication.<\/p>"},{"tips":[],"text":"<p style=\"text-align: center;\">Hindering Roles in Meetings<\/p>","answer":"<p style=\"text-align: center;\">Hindering roles like dominator, unfocused participant, degrader, stubborn member, and distractor can disrupt group interactions and impede meeting progress. Identifying and addressing these roles is crucial for maintaining meeting effectiveness.<\/p>"},{"tips":[],"text":"<p style=\"text-align: center;\">Purpose of Goals in Meetings<\/p>","answer":"<p style=\"text-align: center;\">Goals in meetings provide guidance, set priorities, motivate staff, evaluate progress, and control actions. Understanding organizational goals helps in aligning meeting objectives and ensuring that decisions contribute to achieving strategic, tactical, and operational goals.<\/p>"}],"behaviour":{"enableRetry":true,"disableBackwardsNavigation":false,"scaleTextNotCard":false,"randomCards":true,"maxProficiency":5,"quickProgression":false},"answer":"Turn","next":"Next","prev":"Previous","retry":"Try again","correctAnswer":"I got it right!","incorrectAnswer":"I got it wrong","round":"Round @round","cardsLeft":"Cards left: @number","nextRound":"Proceed to round @round","startOver":"Start over","showSummary":"Next","summary":"Summary","summaryCardsRight":"Cards you got right:","summaryCardsWrong":"Cards you got wrong:","summaryCardsNotShown":"Cards in pool not shown:","summaryOverallScore":"Overall Score","summaryCardsCompleted":"Cards you have completed learning:","summaryCompletedRounds":"Completed rounds:","summaryAllDone":"Well done! You got all @cards cards correct @max times in a row!","progressText":"Card @card of @total","cardFrontLabel":"Card front","cardBackLabel":"Card back","tipButtonLabel":"Show tip","audioNotSupported":"Your browser does not support this audio","confirmStartingOver":{"header":"Start over?","body":"All progress will be lost. Are you sure you want to start over?","cancelLabel":"Cancel","confirmLabel":"Start over"},"title":"<p>Dialog Cards<\/p>\n"}